Ran Plan for 3 projects:

1. dir: `app-infra/notes-app/iam` workspace: `default`
1. dir: `app-infra/notes-app` workspace: `default`
1. dir: `app-infra/notes-app/rds` workspace: `default`
---

### 1. dir: `app-infra/notes-app/iam` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/home/atlantis/.atlantis/bin/terraform1.14.3 plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/mr26/platform-sre-devops-lab/122/default/app-infra/notes-app/iam/default.tfplan"' in '/home/atlantis/.atlantis/repos/mr26/platform-sre-devops-lab/122/default/app-infra/notes-app/iam': exit status 1
data.terraform_remote_state.rds: Reading...
data.terraform_remote_state.rds: Read complete after 0s
data.aws_eks_cluster.this: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=985539781206]
data.aws_eks_cluster.this: Read complete after 0s [id=mgmt-cluster]
data.aws_iam_openid_connect_provider.this: Reading...
data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::985539781206:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/FC0D637E14CD3D170D44594D455232EA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role.app_irsa will be created
  + resource "aws_iam_role" "app_irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/FC0D637E14CD3D170D44594D455232EA:sub" = "system:serviceaccount:notes-app:notes-app-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::985539781206:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/FC0D637E14CD3D170D44594D455232EA"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notes-app-irsa-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_irsa_role_arn = (known after apply)
╷
│ Error: Unsupported attribute
│ 
│   on main.tf line 111, in resource "aws_iam_policy" "app_policy":
│  111:         Resource = "arn:aws:rds-db:${var.region}:${data.aws_caller_identity.current.account_id}:dbuser:${data.terraform_remote_state.rds.outputs.db_resource_id}/${var.db_username}"
│     ├────────────────
│     │ data.terraform_remote_state.rds.outputs is object with 2 attributes
│ 
│ This object does not have an attribute named "db_resource_id".
╵

```
</details>

---
### 2. dir: `app-infra/notes-app` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/mr26/platform-sre-devops-lab/122/default/app-infra/notes-app/default.tfplan"' in '/home/atlantis/.atlantis/repos/mr26/platform-sre-devops-lab/122/default/app-infra/notes-app': exit status 1
╷
│ Warning: Backend configuration ignored
│ 
│   on iam/backend.tf line 2, in terraform:
│    2:   backend "s3" {
│ 
│ Any selected backend applies to the entire configuration, so Terraform
│ expects backend configurations only in the root module.
│ 
│ This is a warning rather than an error because it's sometimes convenient to
│ temporarily call a root module as a child module for testing purposes, but
│ this backend configuration block will have no effect.
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Error: Cycle: module.rds.aws_secretsmanager_secret_version.db, module.rds.data.aws_vpc.selected, module.rds.aws_security_group.rds, module.rds.var.vpc_id (expand), module.rds.aws_db_subnet_group.db, module.rds.var.private_subnet_ids (expand), module.rds.var.db_name (expand), module.rds.aws_secretsmanager_secret.db, module.rds.output.secrets_manager_secret_arn (expand), module.rds.output.rds_endpoint (expand), module.rds.var.db_username (expand), module.rds (close), module.rds.var.aws_region (expand), module.rds.provider["registry.terraform.io/hashicorp/aws"], module.rds.aws_db_instance.this, module.rds.output.db_resource_id (expand), module.rds.var.initial_db_name (expand)
│ 
│ 
╵
╷
│ Error: Cycle: module.iam.var.db_username (expand), module.iam.data.aws_caller_identity.current, module.iam.aws_iam_policy.app_policy, module.iam.aws_iam_role_policy_attachment.app_policy_attach, module.iam.var.service_account_name (expand), module.iam.var.namespace (expand), module.iam.var.cluster_name (expand), module.iam.data.aws_eks_cluster.this, module.iam.data.aws_iam_openid_connect_provider.this, module.iam.var.iam_role_name (expand), module.iam.var.region (expand), module.iam.provider["registry.terraform.io/hashicorp/aws"], module.iam.aws_iam_role.app_irsa, module.iam.output.app_irsa_role_arn (expand), module.iam.var.tf_state_bucket (expand), module.iam.data.terraform_remote_state.rds, module.iam (close), module.iam.var.rds_state_key (expand)
│ 
│ 
╵

```
</details>

---
### 3. dir: `app-infra/notes-app/rds` workspace: `default`
```diff
Changes to Outputs:
+ db_resource_id             = "db-6FP55WSIU3PVVIVQN6ZZ4CLDNQ"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d app-infra/notes-app/rds
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-74fd7c45b6-kd49t:4141/lock?id=mr26%252Fplatform-sre-devops-lab%252Fapp-infra%252Fnotes-app%252Frds%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d app-infra/notes-app/rds
  ```

---
### Plan Summary

3 projects, 1 with changes, 0 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```